#ifndef _HWT101CT_TTL_H_
#define _HWT101CT_TTL_H_
/*-------------------------------文件包含--------------------------------*/
#include "stm32f10x.h"

/*--------------------------------宏定义---------------------------------*/
#define Get_Angle angle                                                     //读取陀螺仪角度的宏定义
/*-------------------------------全局变量--------------------------------*/
extern volatile uint32_t raw_data[22];                                      //陀螺仪原始数据
extern volatile float angle;                                                //陀螺仪实时角度
extern volatile float w_z;                                                      //陀螺仪实时角度加速度
/*-------------------------------函数声明--------------------------------*/
void HWT101CT_init(void);                                                   //初始化并开启陀螺仪数据自动读取
#endif
